#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.main_bucket: Refreshing state... [id=corentin-ducatez-6-merge-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.main_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "main_bucket" {
      + force_destroy               = true
        id                          = "corentin-ducatez-6-merge-bucket"
        tags                        = {}
        # (11 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_acl.bucket_acl will be created
  + resource "aws_s3_bucket_acl" "bucket_acl" {
      + acl    = "public-read"
      + bucket = "corentin-ducatez-6-merge-bucket"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_website_configuration.bucket_website_configuration will be created
  + resource "aws_s3_bucket_website_configuration" "bucket_website_configuration" {
      + bucket           = "corentin-ducatez-6-merge-bucket"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + website_endpoint = "corentin-ducatez-6-merge-bucket"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```

</details>

*Pushed by: @Wasta-Geek, Action: `pull_request`*